a=3
b=-14
c=-5
D=(b**2)-(4*a*c)
print(D)
import math
if D>0:
    x=((-b)+math.sqrt(D))/2*a
    i=((-b)-math.sqrt(D))/2*a
    print(x,i)
elif D==0:
    x=-b/(2/a)
    print(x)
else: 
    print ("корней нет")


import datetime
timenow = datetime.datetime.now().strftime("%H:%M")
print(timenow)
nativeCaseMinets = {1: 'Одна', 2: 'Две', 3: 'Три', '4': 'Четыре', '5': 'Пять', '6': 'Шесть', '7': 'Семь', '8': 'Восемь', '9': 'Девять', '10': 'Десять', '11':'Одиннадцать', '12':'Двеннадцать', '13':'Тринадцать', '14':'Четырнадцать', '15':'Пятнадцать', '16':'Шестнадцать', '17':'Семнадцать', '18':'Восемнадцать', '19':'Девятьнадцать', '20':'Двадцать', '21':'Двадцать один', '22':'Двадцать два', '23':'Двадцать три', '24':'Двадцать четыре, "25":"Двадцать пять", '26':"Двадцать шест", '27':"Двадцать семь", '28':"Двадцать восемь", '29':"Двадцать девять", '31':"Тридцать одна", '32':"Тридцать две", '33':"Тридцать три", '34':"Тридцать четыре", '35':"Тридцать пять", '36':"Тридцать шесть", '37':"Тридцать семь", '38':"Тридцать восемь", '39':"Тридцать девять", '40':"Cорок", '41':"Сорок одна", '42':"Сорок две", '43':"Сорок три", '44':"Сорок Четыре",}
print(nativeCaseMinets(41))